# pip install pandas   // command for install lab.

In [ ]:
# GroupBY  Consept

In [11]:
import pandas as pd

data = {
    "Name":['Swapnil', 'Omkar', 'Prachii','Ajinky','Atharv'],
    "Mark":[98 , 95 , 90 , 80 , 89] ,
    "Age": [22 , 18 , 21 , 27 , 32] ,
    "City":['pune' , 'ahamadnagar' , 'ashti' , 'beed' , 'mumbai' ] ,
    "Gender":['male','male','female','male','male'] ,
}

df = pd.DataFrame(data)
df

      Name  Mark  Age         City  Gender
0  Swapnil    98   22         pune    male
1    Omkar    95   18  ahamadnagar    male
2  Prachii    90   21        ashti  female
3   Ajinky    80   27         beed    male
4   Atharv    89   32       mumbai    male

In [5]:
import pandas as pd

climate = [
    ('Delhi', 33, 10),
    ('Delhi', 35, 9),
    ('Delhi', 36, 8),
    ('Delhi', 31, 7),
    ('Delhi', 38, 6),
    ('Delhi', 39, 5),
    ('Pune', 50, 11),
    ('Pune', 49, 4),
    ('Pune', 48, 3),
    ('Pune', 44, 2),
    ('Pune', 30, 1)
]

df = pd.DataFrame(climate, columns=["City", "Temp", "Wind"])
print(df)

     City  Temp  Wind
0   Delhi    33    10
1   Delhi    35     9
2   Delhi    36     8
3   Delhi    31     7
4   Delhi    38     6
5   Delhi    39     5
6    Pune    50    11
7    Pune    49     4
8    Pune    48     3
9    Pune    44     2
10   Pune    30     1

In [36]:
df1 = df.groupby('City')
df1

In [37]:
for City, rows  in df1:
    print(City)
    print(rows)

Delhi
    City  Temp  Wind
0  Delhi    33    10
1  Delhi    35     9
2  Delhi    36     8
3  Delhi    31     7
4  Delhi    38     6
5  Delhi    39     5
Pune
    City  Temp  Wind
6   Pune    50    11
7   Pune    49     4
8   Pune    48     3
9   Pune    44     2
10  Pune    30     1

In [34]:
df1.get_group("Pune")

    City  Temp  Wind
6   Pune    50    11
7   Pune    49     4
8   Pune    48     3
9   Pune    44     2
10  Pune    30     1

In [35]:
df1.get_group("Delhi")

    City  Temp  Wind
0  Delhi    33    10
1  Delhi    35     9
2  Delhi    36     8
3  Delhi    31     7
4  Delhi    38     6
5  Delhi    39     5

In [39]:
df.max()

City    Pune
Temp      50
Wind      11
dtype: object

In [40]:
df1.max()

       Temp  Wind
City
Delhi    39    10
Pune     50    11